app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @task = Task.find_by(id: params[:id])

INSERT INTO "tasks" ("action", "description", "created_at", "updated_at", "completion_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["action", "Wash "], ["description", "Give Petunia a Bath"], ["created_at", "2018-09-21 21:47:21.831217"], ["updated_at", "2018-09-21 21:47:21.831217"], ["completion_date", "2018-09-28"]]
---
  def create #do
    filtered_task_params = task_params()
    @task = Task.new(filtered_task_params) #instantiate a new book

    is_successful_save = @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "Complete"], ["updated_at", "2018-09-24 14:51:13.956489"], ["id", 39]]
---
    task = Task.find_by(id: params[:id])
    task.update(completion_date: 'Complete')

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def edit #show a form
    @task = Task.find_by(id: params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "action" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["action", "wash"], ["description", "car"], ["updated_at", "2018-09-21 22:12:01.687995"], ["id", 37]]
---
    task = Task.find(params[:id])
    task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 4]]
---
    task = Task.find_by(id: params[:id])

    task.destroy